18-rails-validations/candy-kingdom/app/views/candies/new.html.erb

SELECT "treaters".* FROM "treaters"
---

<%= f.collection_select :treater_id, Treater.all, :id, :name %>