16-rails-associations/candy-kingdom/app/views/treaters/index.html.erb

SELECT "candies".* FROM "candies" WHERE "candies"."treater_id" = ?  [["treater_id", 1]]
---
  <p>Toilet Paper for Neighborhood: <%= treater.tp %> rolls</p>
  <p>Candy: <%= treater.candies.length %></p>