18-rails-validations/candy-kingdom/app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
  def index
    @candies = Candy.all

SELECT  "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @candy = Candy.find(params[:id])

INSERT INTO "candies" ("name", "sugar_level", "treater_id") VALUES (?, ?, ?)  [["name", "Reese's"], ["sugar_level", 44.0], ["treater_id", 3]]
---
  def create
    @candy = Candy.new(candy_params)
    if @candy.valid?
      @candy.save

SELECT "treaters".* FROM "treaters"
---
  def new
    @candy = Candy.new
    @treaters = Treater.all