15-rails-routes-forms-and-params/bad-guys/app/controllers/villains_controller.rb

SELECT "villains".* FROM "villains"
---
  def index
    @villains = Villain.all

INSERT INTO "villains" ("name", "catch_phrase", "power", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Venom"], ["catch_phrase", "thing"], ["power", "stuff"], ["created_at", "2019-10-30 20:01:45.370875"], ["updated_at", "2019-10-30 20:01:45.370875"]]
---
  def create
    @villain = Villain.create(villain_params)