22-rails-auth/dog-walker/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    @dogs = if logged_in?
      current_user.dogs
    else
      Dog.all

SELECT "dogs".* FROM "dogs"
---
  def secret
    @dogs = Dog.all