16-rails-associations/candy-kingdom/app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
  def index
    @candies = Candy.all

INSERT INTO "candies" ("name", "sugar_level", "treater_id") VALUES (?, ?, ?)  [["name", "Reese's"], ["sugar_level", 44.0], ["treater_id", 3]]
---
  def create
    @candy = Candy.create(candy_params)

SELECT "treaters".* FROM "treaters"
---
  def new
    @candy = Candy.new
    @treaters = Treater.all