16-rails-associations/candy-kingdom/app/controllers/treaters_controller.rb

  def index
    @treaters = Treater.all
---
SELECT "treaters".* FROM "treaters"